configuration/src/Catalogs/ExternalUsers/ExternalUsers.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ExternalUsers</name>
  <comment>APK:413 - # 744.2.1.1 it is Acceptable not to disable the selection history, since it is used, and the selection redefinition is fixed, that is, service and invalid users will not get into it, but if they somehow got into it, this is not a problem</comment>
  <attributes>
    <name>Invalid</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AuthorizationObject</name>
    <type>
      <types>DefinedType.ExternalUser</types>
    </type>
  </attributes>
  <attributes>
    <name>SetRolesDirectly</name>
    <comment>Used if the &quot;access Control&quot; subsystem is not built in&quot;</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Prepared</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IBUserID</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ServiceUserID</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>DeleteInfobaseUserProperties</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>TextString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

configuration/src/Constants/UseExternalUsers/ValueManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, OOO 1C-Soft
// All rights reserved. This software and the related materials 
// are licensed under a Creative Commons Attribution 4.0 International license (CC BY 4.0).
// To view the license terms, follow the link:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
//

#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Variables

Var ValueChanged;

#EndRegion

#Region EventsHandlers

Procedure BeforeWrite(Cancel)
	
	If DataExchange.Load Then
		Return;
	EndIf;
	
	ValueChanged = Value <> Constants.UseExternalUsers.Get();
	
	If ValueChanged
	   And Value
	   And Not UsersInternal.ExternalUsersEmbedded() Then
		Raise NStr("en = 'The application does not support external users.';");
	EndIf;
	
EndProcedure

Procedure OnWrite(Cancel)
	
	If DataExchange.Load Then
		Return;
	EndIf;
	
	Constants.UseExternalUserGroups.Refresh();
	
	If ValueChanged Then
		UsersInternal.UpdateExternalUsersRoles();
		If Common.SubsystemExists("StandardSubsystems.AccessManagement") Then
			ModuleAccessManagement = Common.CommonModule("AccessManagement");
			ModuleAccessManagement.UpdateUserRoles(Type("CatalogRef.ExternalUsers"));
			
			ModuleAccessManagementInternal = Common.CommonModule("AccessManagementInternal");
			If ModuleAccessManagementInternal.LimitAccessAtRecordLevelUniversally() Then
				PlanningParameters = ModuleAccessManagementInternal.AccessUpdatePlanningParameters();
				PlanningParameters.ForUsers = False;
				PlanningParameters.ForExternalUsers = True;
				PlanningParameters.IsUpdateContinuation = True;
				PlanningParameters.LongDesc = "UseExternalUsersOnWrite";
				ModuleAccessManagementInternal.ScheduleAccessUpdate(, PlanningParameters);
			EndIf;
		EndIf;
		If Value Then
			UsersInternal.SetShowInListAttributeForAllInfobaseUsers(False);
		Else
			ClearCanSignInAttributeForAllExternalUsers();
		EndIf;
		
		SetPropertySetUsageFlag();
	EndIf;
	
EndProcedure

#EndRegion

#Region Private

// Clears the FlagShowInList attribute for all infobase users.
Procedure ClearCanSignInAttributeForAllExternalUsers()
	
	Query = New Query;
	Query.Text =
	"SELECT
	|	ExternalUsers.IBUserID AS Id
	|FROM
	|	Catalog.ExternalUsers AS ExternalUsers";
	IDs = Query.Execute().Unload();
	IDs.Indexes.Add("Id");
	
	IBUsers = InfoBaseUsers.GetUsers();
	For Each IBUser In IBUsers Do
		
		If IDs.Find(IBUser.UUID, "Id") <> Undefined
		   And Users.CanSignIn(IBUser) Then
			
			IBUser.StandardAuthentication    = False;
			IBUser.OpenIDAuthentication         = False;
			IBUser.OpenIDConnectAuthentication  = False;
			IBUser.AccessTokenAuthentication = False;
			IBUser.OSAuthentication             = False;
			IBUser.Write();
		EndIf;
	EndDo;
	
EndProcedure

Procedure SetPropertySetUsageFlag()
	
	If Not Common.SubsystemExists("StandardSubsystems.Properties") Then
		Return;
	EndIf;
	ModulePropertyManager = Common.CommonModule("PropertyManager");
	
	SetParameters = ModulePropertyManager.PropertySetParametersStructure();
	SetParameters.Used = Value;
	ModulePropertyManager.SetPropertySetParameters("Catalog_ExternalUsers", SetParameters);
	
EndProcedure

#EndRegion

#Else
Raise NStr("en = 'Invalid object call on the client.';");
#EndIf
